# Библиотека Pandas

## Data Frame

In [7]:
import pandas as pd

In [9]:
frame = pd.DataFrame({'numbers':xrange(11),'chars':['a']*11})

In [11]:
frame

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     a       10

In [13]:
type(frame)

pandas.core.frame.DataFrame

In [16]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [18]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [20]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [22]:
frame.rows

AttributeError: 'DataFrame' object has no attribute 'rows'

In [24]:
frame.shape

(6, 4)

In [27]:
new_line = {'Name':'Dudukin','Birth':'06.07.1990','City':'Sarov'}

In [34]:
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6          Dudukin  06.07.1990      Sarov       NaN

In [36]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [39]:
frame = frame.append(new_line, ignore_index=True)

In [41]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6          Dudukin  06.07.1990      Sarov       NaN
7          Dudukin  06.07.1990      Sarov       NaN
8          Dudukin  06.07.1990      Sarov       NaN

In [44]:
frame.drop([6,8], axis=0, inplace=True)

In [45]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
7          Dudukin  06.07.1990      Sarov       NaN